#include <iostream>

// подаване на статичен масив по референция.
// така винаги се ограничаваме до конкретен тип (int)
// и конкретен брой елементи в масива (10)
void print(int (&a)[10]) {
  for (unsigned i = 0; i < 10; ++i)
    std::cout << a[i] << ' ';
}

// параметризираме функцията по типа на елементите в масива
// и брой елементи в него
template<typename T, size_t N>
void swap(T (&a)[N], T (&b)[N]) {
  // тук го бях оставила i < 10 от примера на семинара,
  // без да искам, би трябвало да е N :)
  for (size_t i = 0; i < N; ++i)
    std::swap(a[i], b[i]);
}

// в общия случай бихме искали да използваме функции от този вид,
// понеже са по-общи (обхващат и статични, и динамични масиви;
// можем и да "отрежем" даден масив до някакъв индекс, т.е. да принтираме
// по-малко елементи, отколко има)
template<typename T>
void print(T *arr, size_t n) {
  for (size_t i = 0; i < n; ++i)
    std::cout << arr[i] << '\n';
}

int main() {

  int arr1[3]{1,2,3};
  int arr2[3]{4,5,6};
  int arr3[10];

  swap(arr2, arr1);

  print(arr1, 3);
  std::cout << '\n';

  print(arr2, 3);
  std::cout << '\n';

  return 0;
}
