#ifndef __UTIL_HPP
#define __UTIL_HPP

#include <cstddef>
#include <functional>
#include <stdexcept>
#include <vector>

// следният дълъг коментар не е задължително знание за курса :)
// но съдържа неща, някои от които ще разглеждате по СДП,
// така че може да е полезно

// на семинар бяхме казали, че този клас може да бъде параметризиран не само
// по типа на елементите във вектора (понеже искаме помощните функции по-долу
// да работят за std::vector), но и по самия контейнер.
// това може да бъде направено чрез т.нар. template template синтаксис:

/*
template<typename T, template<typename> class Container>
*/

// като така указваме, че Container е едноместен типов конструктор.
// това го прави непълен тип. пълни типове са например std::vector<int>,
// std::vector<T> и т.н., но сам по себе си std::vector НЕ Е пълен тип,
// защото не можем да конструираме стойност от този тип, т.е
// std::vector vec = ...; е нелегален синтаксис, защото
// е необходимо да укажем някакъв конкретен тип на елементите, т.е.
// да подадем някакъв `тип` на този едноместен типов конструктор,
// който ще ни създаде конкретен (пълен) тип.
// забележете, че технически можем да параметризираме класа и по пълен тип:

/*
template<typename Container>
*/

// за да може, например, да избегнем да пишем и типа на елементите в контейнера.
// това обаче не ни помага особено - причината за това е, че можем да подадем
// типове като std::vector<int>, std::vector<std::pair<int, Foo>> и т.н.,
// но така НЕ получаваме информация за елементите на контейнера,
// а само за цялостния тип. затова е необходимо да имаме експлицитно
// разделение между типа на елементите T и едноместния конструктор за контейнера Container,
// както по-горе

// на този етап в знанията ни за C++, обаче, няма как да се възползваме от горното.
// друг примерен клас за контейнер в C++ е std::forward_list, който имплементира
// линеен едносвързан списък. при тези списъци, за разлика от векторите, които се представят
// вътрешно чрез динамични масиви (т.е. последователни елементи в паметта),
// елементие на свързаните списъци се заделят на heap-а и могат да са на произволни места в паметта
// (връзките между отделните елементи се реализират чрез указатели).
// затова, ако при векторите индексирането има константна сложност по време (т.е. O(1)),
// то при списъците е необходимо да се обходят всички елементи от началото (главата)
// на списъка до елемента на конкретния индекс. това прави индексирането на списъка операция,
// която има линейна сложност по време - O(n), което е сравнително скъпо.
// затова обикновено списъците не реализират начини за индексиране.
// това обаче повдига въпроса как можем да обхождаме списъци - досега за вектори
// сме разглеждали обхождане именно чрез operator[].

// в действителност на семинари сме виждали следния синтаксис:

/*
for (T const &el : vec)
  ...
*/

// който НЕ е специфичен само за вектори, а за всички контейнери в C++,
// които имат ясно дефиниран начин за обхождане. std::forward_list е именно
// такъв контейнер и горният синтаксис важи и за него. но сам по себе си
// този синтаксис не е някаква магия - базира се на шаблон в програмирането,
// по-известен като шаблона Итератор. накратко, итераторите са класове в C++,
// които се имплементират ръчно за всеки контейнер спрямо вътрешното представяне
// на контейнера (очевидно имплементациите за вектор и списък биха били различни).
// те ни предоставят интерфейс (набор от методи), които ни позволяват обхождането
// на какъвто и да е контейнер. тук е заложен именно принципа на абстакция -
// интересува ни само интерфейса (т.е. как можем да обхождаме), но не и имплементационните
// детайли. ако ви е по-интересно, в тема 08. Template Classes има имплементации
// на вектор и едносвързан списък и имплементации на техните итератори

template<typename T>
class VectorUtil {
public:
  // можем да използваме и функционални указатели:

  /*
  template<typename U>
  using UnaryFunction = U(*)(T const &);
  */

  // и т.н., но ако искаме да можем да подаваме по-сложни функции
  // (които например да зависят от въшни променливи, които да не се
  // подават като аргументи, т.нар. контекст), функционалните указатели няма да работят.
  // за повече информация може да разгледате тема 03. Templates. Higher-order functions
  // за целта ще използваме класа std::function

  template<typename U>
  using UnaryFunction = std::function<U(T const &)>;

  using Predicate = std::function<bool(T const &)>;

  // по-надолу ще видим защо искаме типът да е максимално общ
  template<typename Lhs, typename Rhs, typename Result>
  using BinaryOperation = std::function<Result(Lhs, Rhs)>; // могат да са и референции

  // забележете, че по-надолу няма нужда (и е грешно) да пишем, например,
  // Predicate<T>! дори и T да е типова променлива, тя е ФИКСИРАНА,
  // т.е. може да си мислим, че представя някакъв конкретен тип
  // в scope-а на класа, тъй като е свързана променлива

  // map е функция от по-висок ред, която приема контейнер и едноместна функция
  // и прилага тази функция върху всички елементи в контейнера. възможно е тази функция
  // да промени типа на тези елементи, например бихме могли да преобразуваме вектор
  // от елементи от тип int до вектор от елементи от тип char. за целта трябва да създадем
  // изцяло нов вектор с елементи от резултатния тип. ако функцията беше хомогенна
  // (т.е. не променя типа), можеше да променим директно вектора, който ни се подава
  template<typename U>
  static std::vector<U> map(std::vector<T> const &vec, UnaryFunction<U> const &f) {
    std::vector<U> result(vec.size());  // предварително заделяме достатъчно памет

    for (std::size_t i = 0; i < vec.size(); ++i)
      // тук е важно да използваме result[i] вместо result.push_back! обяснението е след функцията
      result[i] = f(vec[i]);

    return result;
  }

  // разлика между operator[] и push_back:
  // ако вместо оператора за индексиране по-горе бяхме използвали push_back,
  // щяхме да получим резултатен вектор с двойно по-голям размер.
  // конструкторът std::vector<T>(std::size_t) не само заделя памет,
  // но и инициализира елементите на вектора (т.е. модифицира и размера, не само - капацитета).
  // това означава, че вече имаме съществуващи елементи във вектора и с push_back бихме
  // добавили нови такива. затова горе трябва да използваме operator[].
  // обратно, ако сме използвали конструктора по подразбиране, трябва да използваме
  // push_back, за да добавим нови елементи, защото иначе ще се опитаме да достъпим
  // елементи на невалидни индекси

  // пример за map с хомогенна функция. модифицираме вектора in-place
  static void map(std::vector<T> &vec, UnaryFunction<T> const &f) {
    // тук референцията е важна! само T el би направило копие на el
    for (T &el : vec)
      el = f(el);

    /*
    for (std::size_t i = 0; i < vec.size(); ++i)
      vec[i] = f(vec[i]);
    */
  }

  // filter добавя към резултата елементите от vec, които изпълняват предиката.
  // получаваме контейнер, който е с дължина, по-малка или равна на оригиналната дължина
  // на контейнера
  static std::vector<T> filter(std::vector<T> const &vec, Predicate const &pred) {
    std::vector<T> result;

    for (T const &el : vec)
      if (pred(el))
        result.push_back(el);

    return result;
  }

  // версията с in-place модицикация
  static void filter(std::vector<T> &vec, Predicate const &pred) {
    std::size_t read = 0, write = 0;

    while (read < vec.size()) {

      if (pred(vec[read]))
        vec[write++] = vec[read];

      read++;

    }

    vec.resize(write);
  }

  // reduce е функция, която агрегира елементите на някакъв контейнер
  // (т.е. прилага функция последователно върху елементие).
  // например, ако имаме [1,2,3] и двуместна функция, която просто събира два елемента,
  // то редукцията би изглеждала така:
  // ((1 + 2) + 3)
  // (3 + 3)
  // 6
  // очевидно взимаме два елемента от контейнер с елементи от тип T, така че
  // това са типовете на аргументите на двуместната операция. тъй като използваме
  // резултата от предишното изчисление за следващото такова (напр. 1 + 2,
  // за да оценим (1 + 2) + 3), то очевидно бихме искали да подаваме този резултат
  // на операцията - следователно резултатният тип също е T
  static T reduce(std::vector<T> const &vec, BinaryOperation<T, T, T> const &op) {
    // забележете, че е нужен поне един елемент!
    // дори и да имаме неутрален елемент относно събирането на int-ове,
    // това не е изпълнено за всички типове T и операции (напр. изваждане)
    if (vec.empty())
      throw std::runtime_error("no elements to reduce");

    T result = vec[0];

    for (std::size_t i = 1; i < vec.size(); ++i)
      result = op(result, vec[i]);

    return result;
  }

  // ако искаме горната функция, можем да добавим неутрален елемент
  // като експлицитна зависимост
  static T reduceHom(T nv, std::vector<T> const &vec, BinaryOperation<T, T, T> const &op) {
    for (T const &el : vec)
      nv = op(nv, el);

    return nv;
  }

  // горната функция може да бъде по-обща. вече първото извикване на операцията
  // ще бъде върху nv и първия елемент на контейнера (ако има такъв, иначе връщаме nv).
  // така че можем да "отделим" типа на nv от този на елементите в контейнера
  // и да получим по-обща функция. тази функция е по-позната във функционалното програмиране
  // като foldLeft, така че ще я кръстим по този начин.
  // нарича се foldLeft, защото контейнерът бива "свиван" отляво на дясно.
  // често се използва за моделирането на итеративни процеси във ФП
  // (ще разберете по-подробно следващия семестър)
  template<typename U>
  static U foldLeft(U nv, std::vector<T> const &vec, BinaryOperation<U, T, U> const &op) {
    for (T const &el : vec)
      nv = op(nv, el);

    return nv;
  }

  // разбира се, има смисъл да започнем да свиваме и отдясно на ляво.
  // такава функция е по-позната като foldRight.
  // използва се за свивания, които се моделират естествено чрез рекурсия.
  // забележете разликата между типовете в операциите на foldLeft и foldRight
  template<typename U>
  static U foldRight(U nv, std::vector<T> const &vec, BinaryOperation<T, U, U> const &op) {
    if (vec.empty()) // може vec.size() == 0 и да underflow-нем
      return nv;

    for (long i = vec.size() - 1; i >= 0; --i)
      nv = op(vec[i], nv);

    return nv;
  }
};

#endif // __UTIL_HPP
